back-end/app/views/books/show.html.erb

Copies
<% @book.copies.each do |copy| %>
---
SELECT "copies".* FROM "copies" WHERE "copies"."book_id" = ?  [["book_id", 8]]