app/controllers/copies_controller.rb

  def index
    @copies = Book.find(params[:book_id]).copies
---
SELECT "copies".* FROM "copies" WHERE "copies"."book_id" = ?  [["book_id", 8]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def show
    @copy = Book.find(params[:book_id]).copies.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "copies".* FROM "copies" WHERE "copies"."book_id" = ? AND "copies"."id" = ? LIMIT ?  [["book_id", 8], ["id", 2], ["LIMIT", 1]]

  def create
    @book = Book.find(params[:book_id])
    @copy = @book.copies.create(comment_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "copies" ("created_at", "updated_at", "borrower", "book_id", "due_date") VALUES (?, ?, ?, ?, ?)  [["created_at", "2024-09-13 16:08:48.785170"], ["updated_at", "2024-09-13 16:08:48.785170"], ["borrower", "xmn sd "], ["book_id", 8], ["due_date", "mcn dn as"]]