back-end/app/controllers/books_controller.rb

INSERT INTO "books" ("created_at", "updated_at", "title", "author", "isbn") VALUES (?, ?, ?, ?, ?)  [["created_at", "2024-09-13 15:45:01.019085"], ["updated_at", "2024-09-13 15:45:01.019085"], ["title", "fkjnvbhsjreabj"], ["author", "jbdejhbre"], ["isbn", "bdchjhv"]]
---
  def create
    @book = Book.new(book_params)

    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "updated_at" = ?, "isbn" = ? WHERE "books"."id" = ?  [["updated_at", "2024-09-13 14:59:14.694277"], ["isbn", " 9781784876400"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])

    if @book.update(book_params)